---
type: ModelCurveArrArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ModelCurveArrArray

`Autodesk.Revit.DB.ModelCurveArrArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ModelCurveArrArray | — | `public ModelCurveArrArray ()` |
| Method | Append | — | `public virtual void Append ( ModelCurveArray item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ModelCurveArrArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( ModelCurveArray item , int index )` |
| Method | ReverseIterator | — | `public virtual ModelCurveArrArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual ModelCurveArray this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |